package Guava;

import com.google.common.base.CaseFormat;
import com.google.common.base.Converter;
import com.google.common.collect.Lists;
import com.google.common.primitives.Doubles;
import model.User;
import org.joda.time.DateTime;
import org.joda.time.Days;
import org.junit.Test;

import java.util.Comparator;
import java.util.List;
import java.util.stream.Collectors;

/**
 * @author zhangkangkang created on 2021/3/12 11:26 下午
 */
public class ConverterTest {

    /**
     * 驼峰转下划线
     */
    @Test
    public void testConverter() {
        Converter<String, Double> stringDoubleConverter = Doubles.stringConverter();
        Converter<String, String> underScoreConverter = CaseFormat.LOWER_CAMEL.converterTo(CaseFormat.LOWER_UNDERSCORE);
        System.out.println(underScoreConverter.convert("aaaAAA"));
        System.out.println(underScoreConverter.convert("BaaAAA"));
        System.out.println(underScoreConverter.convert("aaaAaa"));
    }

    @Test
    public void testLength() {
        String s = "===  2021-03-15 网约车 - 每周报警信息统计  ===\n" +
                "\n" +
                "郑州本地\n" +
                "-----------------------------------------------------                                 \n" +
                "一、总成功率: 34%，具体报警信息如下: \n" +
                "1、2小时成功率低于20%，共发生14次，持续时长3890分钟:\n" +
                "2021-03-09 17:00 ~ 2021-03-09 19:05，影响接口数17/17\n" +
                "2021-03-09 17:10 ~ 2021-03-09 21:05，影响接口数17/17\n" +
                "2021-03-10 17:40 ~ 2021-03-10 19:45，影响接口数17/17\n" +
                "2021-03-10 17:50 ~ 2021-03-10 20:45，影响接口数17/17\n" +
                "2021-03-11 07:50 ~ 2021-03-11 09:55，影响接口数17/17\n" +
                "2021-03-11 08:00 ~ 2021-03-11 12:25，影响接口数17/17\n" +
                "2021-03-11 16:15 ~ 2021-03-11 18:20，影响接口数17/17\n" +
                "2021-03-11 16:25 ~ 2021-03-11 22:00，影响接口数17/17\n" +
                "2021-03-12 07:25 ~ 2021-03-12 09:30，影响接口数17/17\n" +
                "2021-03-12 07:35 ~ 2021-03-12 23:20，影响接口数17/17\n" +
                "2021-03-13 11:05 ~ 2021-03-13 13:10，影响接口数17/17\n" +
                "2021-03-13 11:15 ~ 2021-03-13 22:50，影响接口数17/17\n" +
                "2021-03-14 15:15 ~ 2021-03-14 17:20，影响接口数17/17\n" +
                "2021-03-14 15:25 ~ 2021-03-14 21:30，影响接口数17/17\n" +
                "\n" +
                "2、3小时成功率低于50%，共发生40次，持续时长9055分钟:\n" +
                "2021-03-08 19:40 ~ 2021-03-08 22:40，影响接口数17/17\n" +
                "2021-03-08 19:50 ~ 2021-03-08 22:50，影响接口数17/17\n" +
                "2021-03-08 20:00 ~ 2021-03-08 23:00，影响接口数17/17\n" +
                "2021-03-09 06:30 ~ 2021-03-09 13:40，影响接口数16/17\n" +
                "2021-03-09 10:50 ~ 2021-03-09 13:50，影响接口数16/17\n" +
                "2021-03-09 11:00 ~ 2021-03-09 18:55，影响接口数17/17\n" +
                "2021-03-09 18:35 ~ 2021-03-09 22:10，影响接口数17/17\n" +
                "2021-03-09 19:20 ~ 2021-03-09 22:20，影响接口数17/17\n" +
                "2021-03-10 06:25 ~ 2021-03-10 19:35，影响接口数17/17\n" +
                "2021-03-11 06:05 ~ 2021-03-11 09:45，影响接口数17/17\n" +
                "2021-03-11 10:40 ~ 2021-03-11 13:40，影响接口数17/17\n" +
                "2021-03-11 10:50 ~ 2021-03-11 13:50，影响接口数17/17\n" +
                "2021-03-11 13:35 ~ 2021-03-11 18:10，影响接口数17/17\n" +
                "2021-03-11 19:25 ~ 2021-03-11 22:25，影响接口数17/17\n" +
                "2021-03-11 19:35 ~ 2021-03-11 22:35，影响接口数17/17\n" +
                "2021-03-11 19:45 ~ 2021-03-11 23:10，影响接口数17/17\n" +
                "2021-03-11 20:20 ~ 2021-03-11 23:20，影响接口数17/17\n" +
                "2021-03-12 05:40 ~ 2021-03-12 09:20，影响接口数17/17\n" +
                "2021-03-12 20:50 ~ 2021-03-12 23:50，影响接口数17/17\n" +
                "2021-03-12 21:00 ~ 2021-03-13 00:00，影响接口数17/17\n" +
                "2021-03-12 21:10 ~ 2021-03-13 00:10，影响接口数17/17\n" +
                "2021-03-12 21:20 ~ 2021-03-13 00:20，影响接口数17/17\n" +
                "2021-03-12 21:30 ~ 2021-03-13 00:30，影响接口数17/17\n" +
                "2021-03-12 21:40 ~ 2021-03-13 00:40，影响接口数17/17\n" +
                "2021-03-12 21:50 ~ 2021-03-13 00:50，影响接口数17/17\n" +
                "2021-03-13 07:30 ~ 2021-03-13 13:00，影响接口数17/17\n" +
                "2021-03-13 20:10 ~ 2021-03-13 23:10，影响接口数17/17\n" +
                "2021-03-13 20:20 ~ 2021-03-13 23:20，影响接口数17/17\n" +
                "2021-03-13 20:30 ~ 2021-03-13 23:30，影响接口数17/17\n" +
                "2021-03-13 20:40 ~ 2021-03-13 23:40，影响接口数17/17\n" +
                "2021-03-13 20:50 ~ 2021-03-13 23:50，影响接口数17/17\n" +
                "2021-03-13 21:00 ~ 2021-03-14 00:00，影响接口数17/17\n" +
                "2021-03-13 21:10 ~ 2021-03-14 00:10，影响接口数16/17\n" +
                "2021-03-13 21:20 ~ 2021-03-14 00:20，影响接口数16/17\n" +
                "2021-03-14 10:05 ~ 2021-03-14 17:10，影响接口数17/17\n" +
                "2021-03-14 19:25 ~ 2021-03-14 22:25，影响接口数17/17\n" +
                "2021-03-14 19:35 ~ 2021-03-14 22:35，影响接口数17/17\n" +
                "2021-03-14 19:45 ~ 2021-03-14 22:45，影响接口数17/17\n" +
                "2021-03-14 19:55 ~ 2021-03-14 22:55，影响接口数17/17\n" +
                "2021-03-15 05:35 ~ 2021-03-15 09:45，影响接口数17/17\n" +
                "\n" +
                "\n" +
                "-----------------------------------------------------\n" +
                "山西公安\n" +
                "-----------------------------------------------------                                 \n" +
                "一、总成功率: 99%，具体报警信息如下: \n" +
                "1、30分钟...";
        int length = s.length();
        System.out.println("length = " + length);
    }

    @Test
    public void testDate() {
        DateTime begin = new DateTime(2021, 3, 10, 0, 0);
        DateTime end = new DateTime(2021, 3, 10, 0, 0);
        int days = Days.daysBetween(begin, end).getDays();
        System.out.println("days = " + days);
    }
}
